{
  "text": "OMusic 最终用户许可协议 (EULA)\n\n最后更新日期：2025年10月3日\n\n欢迎您使用 OMusic！\n\n在您（以下或称“用户”）使用 OMusic 软件（以下简称“本软件”）及相关服务之前，请务必仔细阅读并透彻理解本《最终用户许可协议》（以下简称“本协议”）。本协议是您与 OMusic 软件开发者（以下简称“许可方”）就本软件的许可使用及相关服务所订立的具有法律约束力的协议。\n\n一旦您点击“同意并继续”按钮，即表示您已完全理解并接受本协议的所有条款，并同意受其约束。如果您不同意本协议的任何内容，请立即点击“不同意并退出”并停止使用本软件。\n\n第一条：许可的授予\n\n1.1. 许可性质：本协议授予您的是一项个人的、不可转让的、非独占的软件使用许可。您购买的是在本协议条款约束下使用本软件的权利。\n\n1.2. 授权范围：在您同意本协议并成功完成激活后，许可方授予您在单台授权设备上安装、运行并使用本软件的权利。\n\n1.3. 保留权利：除本协议明确授予您的权利外，本软件的一切其他权利（包括但不限于所有权、知识产权）均由许可方保留。未经许可方事先书面同意，您不得行使本协议未明确授予的任何其他权利。\n\n第二条：使用限制与知识产权\n\n2.1. 知识产权声明：本软件（包括但不限于其中的所有代码、文本、图像、音频、用户界面及相关文档）的全部知识产权，包括但不限于著作权、商标权和专利权，均归许可方所有，并受中华人民共和国及国际知识产权相关法律法规的保护。\n\n2.2. 禁止行为：您不得，也不得允许任何第三方从事以下行为：\n    a) 对本软件进行复制、修改、反向工程、反编译、反汇编或试图提取源代码。\n    b) 移除、遮盖或更改本软件中包含的任何版权、商标或其他所有权声明。\n    c) 将本软件或您的激活凭证（如许可证文件）出租、出借、出售、再许可、分发或转让给任何第三方。\n    d) 利用本软件创建衍生作品，或将其用于任何商业目的（除非获得许可方明确的书面授权）。\n    e) 使用本软件从事任何违反法律法规或侵犯第三方合法权益的活动。\n\n第三条：隐私政策\n\n3.1. 设备信息收集：为了提供激活和授权验证服务，本软件在激活过程中会收集您的设备唯一标识符（deviceId）以及必要的设备信息（如品牌、型号、系统版本等）。这些信息仅用于将许可证与您的设备进行绑定，以确保授权的有效性。\n\n3.2. 数据安全：许可方承诺采取合理的安全措施来保护您的设备信息安全，防止未经授权的访问、使用或泄露。我们不会将您的个人设备信息与任何第三方分享，除非是为遵守适用法律法规的强制性要求。\n\n3.3. 无个人身份信息：我们不会主动收集、存储或传输任何可直接识别您个人身份的信息（如姓名、联系方式、照片等）。\n\n第四条：免责声明与责任限制\n\n4.1. “按原样”提供：本软件及其相关服务均“按原样”提供，不附带任何形式的明示或默示的保证，包括但不限于对适销性、特定用途适用性及不侵权的保证。\n\n4.2. 风险自负：您理解并同意，您使用本软件所产生的一切风险由您自行承担。在法律允许的最大范围内，许可方在任何情况下均不对因使用或无法使用本软件而导致的任何直接、间接、偶然、特殊、惩罚性或后果性的损害（包括但不限于利润损失、数据丢失或业务中断）负责。\n\n4.3. 第三方服务：本软件可能依赖或链接到第三方提供的内容或服务（如音乐 API 接口）。许可方对此类第三方内容或服务的准确性、合法性、可用性及安全性不作任何保证，亦不承担任何责任。您理解并同意，第三方服务的变更、中断或终止可能导致本软件部分或全部功能无法使用。\n\n第五条：协议的变更与终止\n\n5.1. 协议变更：许可方保留随时修改本协议条款的权利。修改后的协议将在本软件的新版本中公布或通过其他适当方式通知您。您继续使用新版本的行为，将被视为您已接受修改后的协议。\n\n5.2. 协议终止：如果您未能遵守本协议的任何条款，您在本协议下的所有权利将自动终止，无需另行通知。协议终止后，您必须立即停止使用本软件并销毁其所有副本。\n\n第六条：其他\n\n6.1. 签订地点：本协议签订地为中华人民共和国重庆市万州区。\n\n6.2. 法律适用与争议解决：本协议的订立、执行、解释及争议的解决均应适用中华人民共和国大陆地区法律。若您与许可方就本协议内容或其执行发生任何争议，双方应首先友好协商解决；协商不成的，任何一方均有权将争议提交至本协议签订地，即中国大陆重庆市万州区有管辖权的人民法院通过诉讼方式解决。\n\n6.3. 可分割性：如果本协议的任何条款因任何原因被认定为无效或不具执行力，其余条款仍应保持完全的法律效力。\n\n6.4. 完整协议：本协议构成了您与许可方之间关于本软件的完整协议，并取代所有先前的口头或书面沟通、陈述或协议。\n\n如果您对本协议有任何疑问，请通过本软件“关于”页面提供的官方渠道联系我们。"
}
